console.log(' Задание 1 =====================================================')
for (let i = 2; i <= 12; i += 2) {
    console.log(i)
}
console.log(' Задание 2 =====================================================')
for (let i = 10; i >= 1; i--) {
    console.log(i)
}
console.log(' Задание 3 =====================================================')
i = 2
while (i <=12) {
    console.log(i)
    i+=2
}
console.log(' Задание 4 =====================================================')
j=10
while (j >=1) {
    console.log(j)
    j--
}


